[
    {
        "recipeName": "Sloppy Joe",
        "description": "Saucy, beefy and so satisfying. We´re convinced this is the BEST recipe for a homemade Sloppy Joe. Ground beef in a hearty tomato sauce served on toasted hamburger buns is a great idea for lunch or dinner.",
        "ingredients": ["Ground Beef", "Bell pepper", "Onion & Garlic", "Homemade Sauce"],
        "instructions": ["Chop veggies - Finely chop the onion and green bell pepper.", "Make sauce - In a bowl, combine worcestershire sauce, yellow mustard, water, brown sugar, and tomato sauce.", "Saute beef - In a deep skillet, heat oil over med/high heat. Add the ground beef and break up as it is being cooked. Season with salt and pepper and add in the finely chopped onion and green pepper. Cook until vegetables are tender.", "Add sauce - Add in the garlic and cook until fragrant. Pour in the sauce and cook over medium high heat until the sauce comes to a soft boil.", "Simmer - Reduce the heat to low and cook for 10 minutes, add more salt and pepper if needed.", "Serve - spoon the saucy beef mixture on toasted buns and serve as sandwiches."],
        "image": "https://bakeitwithlove.com/wp-content/uploads/2020/10/Sloppy-Joes-lg.jpg.webp",
        "tags": ["sandwich", "meat"]
    },
    {
        "recipeName": "Beef Milanese",
        "description": "Classic beef milanese, crispy on the outside and tender on the inside. Perfect to accompany with mashed potatoes or salad.",
        "ingredients": ["Beef steaks", "Eggs", "Breadcrumbs", "Garlic", "Parsley", "Salt", "Pepper"],
        "instructions": ["Beat the eggs in a bowl with chopped garlic and parsley, salt, and pepper.", "Dip the beef steaks into the egg mixture and then coat them with breadcrumbs, pressing to adhere well.", "Fry in hot oil until golden brown on both sides.", "Place on absorbent paper to remove excess oil and serve."],
        "image": "https://media.minutouno.com/p/50f26b8faa84532f1e4e20e61dee3094/adjuntos/150/imagenes/040/677/0040677625/milanesa-entrana.jpg",
        "tags": ["beef", "fried"]
    },
    {
        "recipeName": "Rice Stew",
        "description": "A simple and comforting stew, ideal for cold days. Made with rice, beef, and vegetables.",
        "ingredients": ["Rice", "Beef", "Onion", "Bell pepper", "Tomato", "Carrot", "Garlic", "Broth", "Salt", "Pepper"],
        "instructions": ["In a large pot, brown the beef cut into cubes with a little oil.", "Add chopped onion, bell pepper, carrot, and garlic. Cook until vegetables are tender.", "Add chopped tomato and rice. Mix well.", "Add broth and bring to a boil. Reduce heat and simmer until rice is tender.", "Season with salt and pepper to taste and serve hot."],
        "image": "https://www.hospitalaleman.org.ar/wp-content/uploads/2015/04/4391690_orig-e1428951553937.jpg",
        "tags": ["rice", "stew"]
    },
    {
        "recipeName": "Mozzarella Pizza",
        "description": "Classic mozzarella pizza with a crispy base topped with tomato sauce and melted cheese.",
        "ingredients": ["Pizza dough", "Tomato sauce", "Mozzarella", "Oregano", "Olive oil"],
        "instructions": ["Preheat the oven to 220°C (428°F).", "Stretch the pizza dough on a greased baking tray.", "Cover with tomato sauce and sprinkle with oregano.", "Add shredded mozzarella on top.", "Bake for 15-20 minutes or until cheese is melted and crust is golden.", "Drizzle with a bit of olive oil before serving."],
        "image": "https://www.clarin.com/img/2022/09/05/ZcUl4xHKK_720x0__1.jpg",
        "tags": ["pizza", "cheese"]
    },
    {
        "recipeName": "Chicken Milanese",
        "description": "Classic chicken milanese, crispy on the outside and juicy on the inside. Perfect to serve with a squeeze of lemon and a side salad.",
        "ingredients": ["Chicken breasts", "Eggs", "Breadcrumbs", "Garlic", "Parsley", "Salt", "Pepper"],
        "instructions": ["Beat the eggs in a bowl with chopped garlic and parsley, salt, and pepper.", "Dip the chicken breasts into the egg mixture and then coat them with breadcrumbs, pressing to adhere well.", "Fry in hot oil until golden brown on both sides.", "Place on absorbent paper to remove excess oil and serve with a squeeze of lemon."],
        "image": "https://i.blogs.es/fda36a/como-hacer-milanesas-de-pollo-2-/1366_2000.jpg",
        "tags": ["chicken", "fried"]
    },
    {
        "recipeName": "French Fries with Sausages",
        "description": "A quick and easy dish of crispy fries served with fried sausages. Great for a casual meal or snack.",
        "ingredients": ["Potatoes", "Sausages", "Salt", "Oil for frying"],
        "instructions": ["Peel and cut the potatoes into thin strips.", "Heat oil in a deep fryer or large pot.", "Fry the potatoes until golden brown and crispy. Remove and place on absorbent paper to drain excess oil. Sprinkle with salt.", "In the same oil, fry the sausages until cooked through and golden brown.", "Serve the fries with the sausages on the side."],
        "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTJW6q1VA15_BuQ1sFF6_JFzB67ap6ZhKpH1Q&s",
        "tags": ["potatoes", "sausages"]
    },
    {
        "recipeName": "Spanish Tortilla",
        "description": "A traditional Spanish dish made with potatoes and eggs. It’s thick, hearty, and can be served hot or cold.",
        "ingredients": ["Potatoes", "Eggs", "Onion", "Olive oil", "Salt"],
        "instructions": ["Peel and slice the potatoes thinly. Finely chop the onion.", "Heat olive oil in a large pan and add the potatoes and onions. Cook over medium heat until tender but not browned.", "Beat the eggs in a large bowl and season with salt. Add the cooked potatoes and onions and mix well.", "Heat a little more oil in the pan and pour in the egg mixture. Cook on low heat until the bottom is set.", "Flip the tortilla onto a plate and slide it back into the pan to cook the other side until fully set.", "Slide the tortilla onto a plate and let it cool slightly before serving."],
        "image": "https://assets.elgourmet.com/wp-content/uploads/2023/03/cover_kvh73gs5ar_tortilla-1024x683.jpg.webp",
        "tags": ["eggs", "potatoes"]
    },
    {
        "recipeName": "Tomato Soup",
        "description": "A creamy and comforting tomato soup perfect for a quick lunch or dinner. Best served with a side of bread or croutons.",
        "ingredients": ["Tomatoes", "Onion", "Garlic", "Olive oil", "Salt", "Pepper", "Basil", "Cream"],
        "instructions": ["Chop the tomatoes, onion, and garlic.", "In a pot, heat the olive oil and sauté the onion and garlic until softened.", "Add the chopped tomatoes and cook until they break down and release their juices.", "Season with salt and pepper, and add a few basil leaves.", "Blend the mixture until smooth and creamy. Return to the pot and add a splash of cream. Heat through.", "Serve hot with a garnish of basil leaves and a drizzle of olive oil."],
        "image": "https://t1.uc.ltmcdn.com/es/posts/3/0/9/como_hacer_sopa_de_tomate_casera_25903_orig.jpg",
        "tags": ["soup", "vegetarian"]
    },
    {
        "recipeName": "Caesar Salad",
        "description": "A classic Caesar salad with crispy lettuce, creamy dressing, croutons, and Parmesan cheese. Perfect as a side or light meal.",
        "ingredients": ["Romaine lettuce", "Caesar dressing", "Croutons", "Parmesan cheese", "Chicken (optional)"],
        "instructions": ["Wash and chop the romaine lettuce.", "In a large bowl, toss the lettuce with Caesar dressing until well coated.", "Add croutons and grated Parmesan cheese.", "For a heartier salad, add grilled chicken slices on top.", "Serve immediately."],
        "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcR05WL051cVLuZ6KCSJPla_Q4mWfWOu7-DiAg&s",
        "tags": ["salad", "vegetarian", "chicken"]
    },
    {
        "recipeName": "Oatmeal Cookies",
        "description": "Soft and chewy oatmeal cookies with a hint of cinnamon. Great for a sweet snack or dessert.",
        "ingredients": ["Oats", "Flour", "Butter", "Sugar", "Eggs", "Cinnamon", "Baking powder", "Salt"],
        "instructions": ["Preheat the oven to 350°F (175°C).", "In a bowl, cream together the butter and sugar until light and fluffy.", "Beat in the eggs one at a time, then stir in the vanilla extract.", "In another bowl, whisk together the flour, oats, cinnamon, baking powder, and salt.", "Gradually add the dry ingredients to the wet ingredients and mix until combined.", "Drop spoonfuls of dough onto a baking sheet and bake for 10-12 minutes, or until golden brown.", "Let cool on a wire rack before serving."],
        "image": "https://cdn0.recetasgratis.net/es/posts/3/0/3/galletas_de_avena_faciles_y_rapidas_67303_600_square.jpg",
        "tags": ["cookies", "dessert"]
    },
    {
        "recipeName": "Baked Beef",
        "description": "Tender and flavorful baked beef, perfect for a hearty dinner. Serve with roasted vegetables or mashed potatoes.",
        "ingredients": ["Beef roast", "Garlic", "Rosemary", "Olive oil", "Salt", "Pepper"],
        "instructions": ["Preheat the oven to 375°F (190°C).", "Rub the beef roast with olive oil, minced garlic, chopped rosemary, salt, and pepper.", "Place the beef in a roasting pan and roast in the oven for about 1 hour, or until the internal temperature reaches your desired doneness.", "Let the beef rest for 10 minutes before slicing.", "Serve with your favorite side dishes."],
        "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQSYKXZuOOFkNbScj3X3b0KtXVlI2xbZn9gPw&s",
        "tags": ["beef", "main course"]
    }
]
